HW3.tex
% Created 2014-11-13 Thu 17:57
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Clarissa Littler}
\date{\today}
\title{HW 3: Turing Machines}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.7b)}}
\begin{document}

\maketitle
\begin{enumerate}
\item A \emph{Turing machine with left-reset} is similar to an ordinary Turing machine but the transition function has the form

$\delta : Q \times \Gamma \to Q \times \Gamma \times \{ R, RESET \}$

The semantics of the $RESET$ move is that the Turing machine will go all the back to the left-most side of the tape, instead of just moving a step left. Prove that Turing machines with left reset are equivalent to ordinary Turing machines. To do this you'll need to 

\begin{itemize}
\item show that you can turn a Turing machine with left reset into an ordinary Turing machine (the hard part)
\item show that you can turn an ordinary Turing machine into a Turing machine with left reset (the easy part)
\end{itemize}
The easiest way to do this is to simulate one type of movement with the other.

\item Show, by construction, that the Turing-decidable languages are closed under

\begin{enumerate}
\item union
\item intersection
\item complement
\end{enumerate}

\item Give an informal description of the following languages

\begin{itemize}
\item $\{ w | w \text{ contains twice as many 0s as 1s} \}$
\item $\{ w | w \text{ has matching parentheses and a length that's a power of 2}\}$
\end{itemize}

\item Show, by construction, that the Turing \emph{recognizable} languages are closed under

\begin{itemize}
\item Kleene star
\item concatenation
\item reversal
\end{itemize}
Are the \emph{recognizable} languages closed under complement? If not, can you give a counter-example?
\end{enumerate}
% Emacs 24.3.1 (Org mode 8.2.7b)
\end{document}
